// Задача 24.  Задача 24: Напишите программу, которая принимает на вход число 
//(А) и выдаёт сумму чисел от 1 до А.

// 7 -> 28
// 4 -> 10
// 8 -> 36

// int GetSumNum(int a)
// {
//     int sum = 0;
//     for(int i = 0; i <= a; i++)
//     {
//         sum += i;
//     }

//     return sum;
// }

// Console.Write("Введите число: ");
// int sum = Convert.ToInt32(Console.ReadLine());
// Console.WriteLine(GetSumNum(sum));